---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFrom3dTo2dFam
source: html/8c99e41d-98ff-f8bf-f140-3d8593fc6cc1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFrom3dTo2dFam Property

Can't copy 3D element(s) into a 2D family.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantCopyFrom3dTo2dFam { get; }
```